*** UCD Davis

The first order of business would be to make sure that an ARK was minted for
this item.  This is an example ARK, in the temporary space, but it will do.
#+BEGIN_SRC bash
ezid mint erc.who:"Jeffers, Robinson" erc.what:"Granite and cypress" erc.when:1975
#+END_SRC

#+RESULTS:
ark:/99999/fk4w390w24

We can make a comparison of our current implementations of schema.org, using
Cypress and Granite as an example.

The schema.org record minted for this record can be found at:
https://sandbox.dams.libary.ucdavis.edu/ark:/99999/

#+BEGIN_EXAMPLE
<https://sandbox.dams.library.ucdavis.edu/fcrepo/rest/collection/poetry-ex/books/granite-and-cypress>
        schema:isPartOf         <https://sandbox.dams.library.ucdavis.edu/fcrepo/rest/collection/poetry-ex> ;
        rdf:type                fedora:Container ;
        rdf:type                ldp:RDFSource ;
        rdf:type                schema:CreativeWork ;
        rdf:type                ldp:Container ;
        rdf:type                schema:Book ;
        fedora:writable         "false"^^<http://www.w3.org/2001/XMLSchema#boolean> ;
        rdf:type                fedora:Resource ;
        fedora:hasParent        <https://sandbox.dams.library.ucdavis.edu/fcrepo/rest/collection/poetry-ex/books> ;
        fedora:lastModifiedBy   "quinn@ucdavis.edu"^^<http://www.w3.org/2001/XMLSchema#string> ;
        schema:creator          <http://id.loc.gov/authorities/names/n80015557> ;
        schema:creator          <http://id.loc.gov/authorities/names/n80035864> ;
        schema:publisher        <http://id.loc.gov/authorities/names/n93121862> ;
        schema:name             "Granite and cypress"^^<http://www.w3.org/2001/XMLSchema#string> ;
        fedora:createdBy        "quinn@ucdavis.edu"^^<http://www.w3.org/2001/XMLSchema#string> ;
        fedora:created          "2019-07-10T01:50:12.022Z"^^<http://www.w3.org/2001/XMLSchema#dateTime> ;
        fedora:lastModified     "2019-07-10T01:50:13.411Z"^^<http://www.w3.org/2001/XMLSchema#dateTime> ;
        schema:bookFormat       "[29] leaves ; 33 x 54 cm.."^^<http://www.w3.org/2001/XMLSchema#string> ;
        schema:sdLicense        <http://rightsstatements.org/vocab/InC-NC/1.0/> ;
        schema:description      "In cypress slipcase with a window of granite from Jeffers' stoneyard."^^<http://www.w3.org/2001/XMLSchema#string> ;
        schema:description      "Includes index of poems."^^<http://www.w3.org/2001/XMLSchema#string> ;
        schema:sdPublisher      <http://id.loc.gov/authorities/names/no2008108707> ;
        schema:identifier       "ark:/99999/fk4w390w24"^^<http://www.w3.org/2001/XMLSchema#string> ;
        schema:identifier       "PS3519.E27 G7"^^<http://www.w3.org/2001/XMLSchema#string> ;
        schema:sdDatePublished  "2019"^^<http://www.w3.org/2001/XMLSchema#gYear> ;
        schema:inLanguage       "eng"^^<http://www.w3.org/2001/XMLSchema#string> ;
        schema:datePublished    "1975"^^<http://www.w3.org/2001/XMLSchema#string> ;
        ldp:contains            <https://sandbox.dams.library.ucdavis.edu/fcrepo/rest/collection/poetry-ex/books/granite-and-cypress/media> ;
        schema:associatedMedia  <https://sandbox.dams.library.ucdavis.edu/fcrepo/rest/collection/poetry-ex/books/granite-and-cypress/media/images> .
#+END_EXAMPLE

This shows the type of record that we would like to import into the ExLibris
System.  It's also closer to what we'd expect to see from the Primo version of
the sitemap.  Most of the information in this record is taken from the
information from the Alma entry.

There are a few things to note here: Items like the creator and publisher are
linked data; identifiers include call numbers and arks.  Other identifiers could
be helpful.  The record also points to associatedMedia.

